### Dealing with Dates in Python

Python by default does not come with Datetype unlike other languages such as SQL etc... 
However, converting from a string to a Date is not a fuss at all. Here are step by step instructions

1. Convert String to a Datetime using to_datetime() pandas method

In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame({
    'Value_Date' : ['2/1/2020', '3/1/2020', '4/1/2020', '5/1/2020', '6/1/2020'], 
    'Interest_Rate' : [1.5, 1.6, 1.2, 1.39, 1.28]
})

In [4]:
df

  Value_Date  Interest_Rate
0   2/1/2020           1.50
1   3/1/2020           1.60
2   4/1/2020           1.20
3   5/1/2020           1.39
4   6/1/2020           1.28

### Important Convention to Convert a Date from String

Now, lets convert String to a Date
Syntax to follow is following-

#If your string contains the format of DD/MM/YYYY then use following format
df['Value_Date'] = pd.to_datetime(df['Value_Date'], dayfirst=True)

#If your string contains the format of MM/DD/YYYY then use following format
df['Value_Date'] = pd.to_datetime(df['Value_Date'])

In [6]:
df['Value_Date'] = pd.to_datetime(df['Value_Date'], dayfirst=True)

In [7]:
df

  Value_Date  Interest_Rate
0 2020-01-02           1.50
1 2020-01-03           1.60
2 2020-01-04           1.20
3 2020-01-05           1.39
4 2020-01-06           1.28

In [10]:
df['Value_Date'].shift(-1)
df['Value_Date'].shift(1)

0          NaT
1   2020-01-02
2   2020-01-03
3   2020-01-04
4   2020-01-05
Name: Value_Date, dtype: datetime64[ns]

### Dealing with Dates with additional attributes such as Time 

## We will use Format parameter

In [11]:
df = pd.DataFrame({
    'Value_Date' : ['2/1/2020 09:30:00', '3/1/2020 09:30:00', '4/1/2020 09:30:00', '5/1/2020 09:30:00', '6/1/2020 09:30:00'], 
    'Interest_Rate' : [1.5, 1.6, 1.2, 1.39, 1.28]
})

In [16]:
df['Value_Date'] = pd.to_datetime(df['Value_Date'], dayfirst=True, format = "%d/%m/%Y %H:%M:%S")

In [17]:
df

           Value_Date  Interest_Rate
0 2020-01-02 09:30:00           1.50
1 2020-01-03 09:30:00           1.60
2 2020-01-04 09:30:00           1.20
3 2020-01-05 09:30:00           1.39
4 2020-01-06 09:30:00           1.28




# Error Handling

#### Often data contains some bad inputs and Python will throw an error right away. So, to handle such a scenario and let the program continue, we will use ERROR parameter

In [18]:
df = pd.DataFrame({
    'Value_Date' : ['2/1/2020 09:30:00', '3/13/2020 09:30:00', '4/1/2020 09:30:00', '5/1/2020 09:30:00', 'xx/1/2020 09:30:00'], 
    'Interest_Rate' : [1.5, 1.6, 1.2, 1.39, 1.28]
})

In [19]:
df['Value_Date'] = pd.to_datetime(df['Value_Date'], dayfirst=True, format = "%d/%m/%Y %H:%M:%S")

ValueError: time data '3/13/2020 09:30:00' does not match format '%d/%m/%Y %H:%M:%S' (match)

##### We will use Errors = Ignore

By ignoring the errors, program will continue to run but will contain bad data that might contain more issues when such data is called throughout the programs

In [20]:
df['Value_Date'] = pd.to_datetime(df['Value_Date'], dayfirst=True, format = "%d/%m/%Y %H:%M:%S", errors='ignore')
df

           Value_Date  Interest_Rate
0   2/1/2020 09:30:00           1.50
1  3/13/2020 09:30:00           1.60
2   4/1/2020 09:30:00           1.20
3   5/1/2020 09:30:00           1.39
4  xx/1/2020 09:30:00           1.28

#### Now we will use Errors = 'coerce'

By using this option, we can safely earmark bad data

In [22]:
df = pd.DataFrame({
    'Value_Date' : ['2/1/2020 09:30:00', '3/13/2020 09:30:00', '4/1/2020 09:30:00', '5/1/2020 09:30:00', 'xx/1/2020 09:30:00'], 
    'Interest_Rate' : [1.5, 1.6, 1.2, 1.39, 1.28]
})
df['Value_Date'] = pd.to_datetime(df['Value_Date'], dayfirst=True, format = "%d/%m/%Y %H:%M:%S", errors='coerce')
df

           Value_Date  Interest_Rate
0 2020-01-02 09:30:00           1.50
1                 NaT           1.60
2 2020-01-04 09:30:00           1.20
3 2020-01-05 09:30:00           1.39
4                 NaT           1.28




### Create a Date with Year, Month, and Date numericals

In [24]:
df = pd.DataFrame({
    'year': [2019, 2020], 
    'month': [11, 12],
    'day': [30, 31]
})

In [25]:
df

   year  month  day
0  2019     11   30
1  2020     12   31

In [26]:
df['Date'] = pd.to_datetime(df)

In [27]:
df

   year  month  day       Date
0  2019     11   30 2019-11-30
1  2020     12   31 2020-12-31



### Retrieve Date, Month, and Year from a Datetime Field

In [30]:
print(df['Date'].dt.year)
print(df['Date'].dt.month)
print(df['Date'].dt.day)

0    2019
1    2020
Name: Date, dtype: int64
0    11
1    12
Name: Date, dtype: int64
0    30
1    31
Name: Date, dtype: int64



### Find out the Weekday Name as in Monday, Tuesday etc... 

#### This is done by using a Mapping. Assume Monday is the first Day of the week and Sunday is the last. So, we will now create a mapping dictionary for this

In [31]:
dw_mapping={
    0: 'Monday', 
    1: 'Tuesday', 
    2: 'Wednesday', 
    3: 'Thursday', 
    4: 'Friday',
    5: 'Saturday', 
    6: 'Sunday'
}

In [32]:
df = pd.DataFrame({
    'Value_Date' : ['2/1/2020', '3/1/2020', '4/1/2020', '5/1/2020', '6/1/2020'], 
    'Interest_Rate' : [1.5, 1.6, 1.2, 1.39, 1.28]
})
df['Value_Date'] = pd.to_datetime(df['Value_Date'], dayfirst=True, format = "%d/%m/%Y", errors='coerce')
df

  Value_Date  Interest_Rate
0 2020-01-02           1.50
1 2020-01-03           1.60
2 2020-01-04           1.20
3 2020-01-05           1.39
4 2020-01-06           1.28

In [33]:
df['Weekday_Name'] = df['Value_Date'].dt.weekday.map(dw_mapping)
df

  Value_Date  Interest_Rate Weekday_Name
0 2020-01-02           1.50     Thursday
1 2020-01-03           1.60       Friday
2 2020-01-04           1.20     Saturday
3 2020-01-05           1.39       Sunday
4 2020-01-06           1.28       Monday



#### Set Date Colum as an Index on Dataframe


##### Note: - Dataframe Index DOES NOT have to be UNIQUE

In [34]:
df = df.set_index(['Value_Date'])
df

            Interest_Rate Weekday_Name
Value_Date
2020-01-02           1.50     Thursday
2020-01-03           1.60       Friday
2020-01-04           1.20     Saturday
2020-01-05           1.39       Sunday
2020-01-06           1.28       Monday

In [35]:
df.iloc[3]

Interest_Rate      1.39
Weekday_Name     Sunday
Name: 2020-01-05 00:00:00, dtype: object

In [36]:
df.loc["2020-01-03"]

Interest_Rate       1.6
Weekday_Name     Friday
Name: 2020-01-03 00:00:00, dtype: object

#### Load data from CSV File and Analyze it

In [ ]:
#condition = (df['date'] > start_date) & (df['date'] <= end_date)
#df.loc[condition]

In [44]:
df = pd.read_csv('data/city_sales.csv',parse_dates=['date'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1795144 entries, 0 to 1795143
Data columns (total 3 columns):
 #   Column  Dtype
---  ------  -----
 0   date    datetime64[ns]
 1   num     int64
 2   city    object
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 41.1+ MB

In [45]:
df.head()

                 date  num    city
0 2015-01-01 09:00:00    4  London
1 2015-01-01 09:01:00    4  London
2 2015-01-01 09:02:00    3  London
3 2015-01-01 09:03:00    3  London
4 2015-01-01 09:04:00    3  London

In [46]:
df = df.set_index(['date'])
df

                     num       city
date
2015-01-01 09:00:00    4     London
2015-01-01 09:01:00    4     London
2015-01-01 09:02:00    3     London
2015-01-01 09:03:00    3     London
2015-01-01 09:04:00    3     London
...                  ...        ...
2019-01-31 15:56:00    3  Cambridge
2019-01-31 15:57:00    3  Cambridge
2019-01-31 15:58:00    3  Cambridge
2019-01-31 15:59:00    3  Cambridge
2019-01-31 16:00:00    2  Cambridge

[1795144 rows x 2 columns]

In [47]:
df.loc['2018']

                     num       city
date
2018-01-01 09:00:00    2     London
2018-01-01 09:01:00    1     London
2018-01-01 09:02:00    3     London
2018-01-01 09:03:00    3     London
2018-01-01 09:04:00    3     London
...                  ...        ...
2018-12-31 15:56:00    4  Cambridge
2018-12-31 15:57:00    2  Cambridge
2018-12-31 15:58:00    3  Cambridge
2018-12-31 15:59:00    3  Cambridge
2018-12-31 16:00:00    2  Cambridge

[439524 rows x 2 columns]

### Data Aggregation

#### df.loc['2018'] will filter out all rows where 2018 exists. A neat way to filter out 2018 rows

In [51]:
df.loc['2018', 'num'].sum()

1231190

### Total Count by Each City

In [52]:
df.loc['2018'].groupby('city').sum()

              num
city
Cambridge  308428
Durham     307965
London     307431
Oxford     307366

### Data for a Specific Month

In [55]:
df.loc['2018-05']

                     num       city
date
2018-05-01 09:00:00    1     London
2018-05-01 09:01:00    4     London
2018-05-01 09:02:00    3     London
2018-05-01 09:03:00    2     London
2018-05-01 09:04:00    3     London
...                  ...        ...
2018-05-31 15:56:00    3  Cambridge
2018-05-31 15:57:00    4  Cambridge
2018-05-31 15:58:00    2  Cambridge
2018-05-31 15:59:00    3  Cambridge
2018-05-31 16:00:00    3  Cambridge

[38732 rows x 2 columns]

### Data for a Specific Day of the Month

In [57]:
df.loc['2018-05-01']

                     num       city
date
2018-05-01 09:00:00    1     London
2018-05-01 09:01:00    4     London
2018-05-01 09:02:00    3     London
2018-05-01 09:03:00    2     London
2018-05-01 09:04:00    3     London
...                  ...        ...
2018-05-01 15:56:00    2  Cambridge
2018-05-01 15:57:00    3  Cambridge
2018-05-01 15:58:00    3  Cambridge
2018-05-01 15:59:00    3  Cambridge
2018-05-01 16:00:00    1  Cambridge

[1684 rows x 2 columns]

### Select Data between 2 Dates

To select data between two dates, you can usedf.loc[start_date:end_date]

Both Start and End Dates are inclusive

In [60]:
df.loc['2016':'2018']

                     num       city
date
2016-01-01 09:00:00    4     London
2016-01-01 09:01:00    3     London
2016-01-01 09:02:00    4     London
2016-01-01 09:03:00    4     London
2016-01-01 09:04:00    2     London
...                  ...        ...
2018-12-31 15:56:00    4  Cambridge
2018-12-31 15:57:00    2  Cambridge
2018-12-31 15:58:00    3  Cambridge
2018-12-31 15:59:00    3  Cambridge
2018-12-31 16:00:00    2  Cambridge

[1316888 rows x 2 columns]

Select data between 10 and 11 o'clock on the 2nd May 2018

In [63]:
df.loc['2018-05-02 10' : '2018-05-02 10:59:59' ]

                     num       city
date
2018-05-02 10:00:00    2     London
2018-05-02 10:01:00    3     London
2018-05-02 10:02:00    4     London
2018-05-02 10:03:00    4     London
2018-05-02 10:04:00    4     London
...                  ...        ...
2018-05-02 10:55:00    3  Cambridge
2018-05-02 10:56:00    3  Cambridge
2018-05-02 10:57:00    3  Cambridge
2018-05-02 10:58:00    2  Cambridge
2018-05-02 10:59:00    1  Cambridge

[240 rows x 2 columns]

Select data between 10:30 and 10:45 on the 2nd May 2018

In [64]:
df.loc['2018-05-02 10:30' : '2018-05-02 10:45' ]

                     num       city
date
2018-05-02 10:30:00    3     London
2018-05-02 10:31:00    3     London
2018-05-02 10:32:00    1     London
2018-05-02 10:33:00    3     London
2018-05-02 10:34:00    3     London
...                  ...        ...
2018-05-02 10:41:00    3  Cambridge
2018-05-02 10:42:00    3  Cambridge
2018-05-02 10:43:00    3  Cambridge
2018-05-02 10:44:00    3  Cambridge
2018-05-02 10:45:00    1  Cambridge

[64 rows x 2 columns]




## Handle Missing Values using Rolling method

In [65]:
df['rolling_sum'] = df.rolling(3).sum()
df.head()

                     num    city  rolling_sum
date
2015-01-01 09:00:00    4  London          NaN
2015-01-01 09:01:00    4  London          NaN
2015-01-01 09:02:00    3  London         11.0
2015-01-01 09:03:00    3  London         10.0
2015-01-01 09:04:00    3  London          9.0

### Missing values can be filled using Backward or Forward Fill

In [66]:
df['rolling_sum_backfilled'] = df['rolling_sum'].fillna(method='backfill')
df.head()

                     num    city  rolling_sum  rolling_sum_backfilled
date
2015-01-01 09:00:00    4  London          NaN                    11.0
2015-01-01 09:01:00    4  London          NaN                    11.0
2015-01-01 09:02:00    3  London         11.0                    11.0
2015-01-01 09:03:00    3  London         10.0                    10.0
2015-01-01 09:04:00    3  London          9.0                     9.0